RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/wifi-connection-manager/source/COMPONENT_MBEDTLS/cy_wps_aes_ctr_ccm.c
/*
 * $ Copyright Cypress Semiconductor $
 */

/** @file cy_wps_aes_ctr_ccm.c
* @brief AES encryption/decryption functions
*/

/* These functions are derived from the Broadcom WLAN AES-CTR and AES-CCM implementations. */

/* FixMe: This file is specifically used for AES encrypt/decrypt operations in WPS. These can be
 * removed and directly mbedtls AES encrypt/decrypt functions can be used.
 */

#include "mbedtls/aes.h"
#include "cy_wcm_log.h"
#include <stdint.h>
#include <string.h>

#define AES_BLOCK_SZ                      16
#define AES_CTR_MAXBLOCKS                (1 << 16)
#define AES_CCM_AAD_MAX_LEN               0xFEFF
#define AES_CCM_NONCE_LEN                 15
#define AES_CCM_AUTH_LEN                  8
#define AES_CCM_LEN_FIELD_LEN             1
#define AES_CCM_AUTH_FLAGS(iv_len)       (4 * (AES_CCM_AUTH_LEN - 2) + (AES_CCM_NONCE_LEN - 1 - iv_len))
#define AES_CCM_AUTH_AAD_FLAG             0x40
#define AES_CCM_CRYPT_FLAGS(iv_len)      (AES_CCM_NONCE_LEN - 1 - iv_len)

/* NOTE:
 * AES encrypt/decrypt functions are used for WPS functionality. Remaining non-used functions by WPS are kept under
 * AES_SELF_TEST macro to increase the code-coverage of WCM library.
 */

#ifdef AES_SELF_TEST
/* AES-CTR mode encryption/decryption algorithm
 *    - max data_len is (AES_BLOCK_SZ * 2^16)
 *    - nonce must be AES_BLOCK_SZ bytes
 *    - assumes nonce is ready to use as-is (i.e. any
 *        encryption/randomization of nonce/IV is handled by the caller)
 *    - ptxt and ctxt can point to the same location
 *    - returns -1 on error
 */
int aes_crypt_ctr(mbedtls_aes_context *ctx, uint32_t length, const unsigned char *iv, const unsigned char *input, unsigned char *output)
{
    size_t k;
    unsigned char tmp[AES_BLOCK_SZ], ctr[AES_BLOCK_SZ];

    if (length > (AES_BLOCK_SZ * AES_CTR_MAXBLOCKS))
    {
        return (-1);
    }

    memcpy(ctr, iv, AES_BLOCK_SZ);

    while (length >= AES_BLOCK_SZ)
    {
        int i;
        memcpy(tmp, input, 16);
        mbedtls_aes_crypt_ecb(ctx, MBEDTLS_AES_ENCRYPT, ctr, tmp);

        for (i = 0; i < 16; i++)
        {
            output[i] = (unsigned char)(tmp[i] ^ input[i]);
        }

        ctr[AES_BLOCK_SZ - 1]++;
        if (!ctr[AES_BLOCK_SZ - 1])
        {
            ctr[AES_BLOCK_SZ - 2]++;
        }

        input  += 16;
        output += 16;
        length -= 16;
    }

    /* Handle partial block */
    if (length % AES_BLOCK_SZ)
    {
        mbedtls_aes_crypt_ecb(ctx, MBEDTLS_AES_ENCRYPT, ctr, tmp);
        for (k = 0; k < (length % AES_BLOCK_SZ); k++)
        {
            output[k] = input[k] ^ tmp[k];
        }
    }

    return (0);
}

/* AES-CCM mode MAC calculation
 *    - computes AES_CCM_AUTH_LEN MAC
 *    - nonce must be AES_CCM_NONCE_LEN bytes
 *    - returns -1 on error
 */

int aes_ccm_mac(mbedtls_aes_context *ctx, uint32_t length, uint32_t aad_length, const unsigned char *nonce, int nonce_len, const unsigned char *aad_input, const unsigned char *data_input, unsigned char mac_output[8])
{
    unsigned char B_0[AES_BLOCK_SZ];
    unsigned char X[AES_BLOCK_SZ];
    size_t j;
    size_t k, len_left;
    int i = 0;

    if (aad_length > AES_CCM_AAD_MAX_LEN)
    {
        return (-1);
    }

    /* B_0 = Flags || iv || l(m) */
    B_0[0] = AES_CCM_AUTH_FLAGS(nonce_len);

    if (aad_length)
    {
        B_0[0] |= AES_CCM_AUTH_AAD_FLAG;
    }

    memcpy(&B_0[1], nonce, nonce_len);

    for (i = 0, len_left = length; i < AES_CCM_NONCE_LEN - nonce_len; i++, len_left >>= 8)
        B_0[AES_CCM_NONCE_LEN - i] = (unsigned char)(len_left & 0xFF);

    /* X_1 := E( K, B_0 ) */
    mbedtls_aes_crypt_ecb(ctx, MBEDTLS_AES_ENCRYPT, B_0, X);

    /* X_i + 1 := E( K, X_i XOR B_i )  for i = 1, ..., n */

    /* First the AAD */
    if (aad_length != 0)
    {
        X[0] ^= (unsigned char)((aad_length >> 8) & 0xff);
        X[1] ^= (unsigned char)(aad_length & 0xff);
        k = 2;
        j = aad_length;
        while (j--)
        {
            X[k] ^= *aad_input++;
            k++;
            if (k == AES_BLOCK_SZ)
            {
                mbedtls_aes_crypt_ecb(ctx, MBEDTLS_AES_ENCRYPT, X, X);
                k = 0;
            }
        }
        /* Handle partial last block */
        if (k % AES_BLOCK_SZ)
        {
            mbedtls_aes_crypt_ecb(ctx, MBEDTLS_AES_ENCRYPT, X, X);
        }
    }

    /* Then the message data */
    for (k = 0; k < (length / AES_BLOCK_SZ); k++)
    {
        int i;
        for (i = 0; i < 16; i++)
        {
            X[i] = (unsigned char)(data_input[i] ^ X[i]);
        }

        data_input += AES_BLOCK_SZ;
        mbedtls_aes_crypt_ecb(ctx, MBEDTLS_AES_ENCRYPT, X, X);
    }

    /* Last block may be partial, padding is implicit in this xor */
    for (k = 0; k < (length % AES_BLOCK_SZ); k++)
    {
        X[k] ^= *data_input++;
    }

    if (length % AES_BLOCK_SZ)
    {
        mbedtls_aes_crypt_ecb(ctx, MBEDTLS_AES_ENCRYPT, X, X);
    }

    /* T := first-M-bytes( X_n+1 ) */
    memcpy(mac_output, X, AES_CCM_AUTH_LEN);

    return (0);
}

/* AES-CCM mode encryption
 *    - computes AES_CCM_AUTH_LEN MAC and then encrypts ptxt and MAC
 *    - nonce must be AES_CCM_NONCE_LEN bytes
 *    - ctxt must have sufficient tailroom for CCM MAC
 *    - ptxt and ctxt can point to the same location
 *    - returns -1 on error
 */
int aes_encrypt_ccm(mbedtls_aes_context *ctx, uint32_t length, uint32_t aad_length, const unsigned char *nonce, uint8_t nonce_len, const unsigned char *aad_input, const unsigned char *plaintext_input, unsigned char *ciphertext_output, unsigned char mac_output[8])
{
    unsigned char A[AES_BLOCK_SZ], X[AES_BLOCK_SZ];

    /* Initialize counter */
    A[0] = AES_CCM_CRYPT_FLAGS(nonce_len);

    memcpy(&A[1], nonce, nonce_len);
    memset(A + 1 + nonce_len, 0, AES_CCM_NONCE_LEN - nonce_len);

    /* Calculate and encrypt MAC */
    if (aes_ccm_mac(ctx, length, aad_length, nonce, nonce_len, aad_input, plaintext_input, X))
    {
        return (-1);
    }
    if (aes_crypt_ctr(ctx, AES_CCM_AUTH_LEN, A, X, X))
    {
        return (-1);
    }
    memcpy(mac_output, X, AES_CCM_AUTH_LEN);

    /* Encrypt data */
    A[AES_BLOCK_SZ - 1] = 1;
    if (aes_crypt_ctr(ctx, length, A, plaintext_input, ciphertext_output))
    {
        return (-1);
    }

    return (0);
}

/* AES-CCM mode decryption
 *    - decrypts ctxt, then computes AES_CCM_AUTH_LEN MAC and checks it against
 *      then decrypted MAC
 *    - the decrypted MAC is included in ptxt
 *    - nonce must be AES_CCM_NONCE_LEN bytes
 *    - ptxt and ctxt can point to the same location
 *    - returns -1 on error
 */
int aes_decrypt_ccm(mbedtls_aes_context *ctx, uint32_t length, uint32_t aad_length, const unsigned char *nonce, uint8_t nonce_len, const unsigned char *aad_input, const unsigned char *ciphertext_input, unsigned char *plaintext_output)
{
    unsigned char A[AES_BLOCK_SZ];
    unsigned char X[AES_BLOCK_SZ];

    /* Initialize counter */
    A[0] = AES_CCM_CRYPT_FLAGS(nonce_len);
    memcpy(&A[1], nonce, nonce_len);
    memset(A + 1 + nonce_len, 0, AES_CCM_NONCE_LEN - nonce_len);
    A[AES_BLOCK_SZ - 1] = 1;

    /* Decrypt data */
    if (aes_crypt_ctr(ctx, length - AES_CCM_AUTH_LEN, A, ciphertext_input, plaintext_output))
    {
        return (-1);
    }

